Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection Methods
The ProfileItemCrossSection type exposes the following members.
Methods
Name | Description
AddProfileItemAnalysisParamter
 adds a new profile item analisis parameter.
AddProfileItemParamter
 adds a new profile item parameter.
AddProfileItemUserParamter
 adds a new profile item user parameter.
Top
See Also
Reference
ProfileItemCrossSection Class
Tekla.Structures.Catalogs Namespace